//1.完成猜数字游戏。
//
//2.写代码可以在整型有序数组中查找想要的数字，
//找到了返回下标，找不到返回 - 1.（折半查找）
//
//3.编写代码模拟三次密码输入的场景。 
//最多能输入三次密码，密码正确，提示“登录成功”, 密码错误，
//可以重新输入，最多输入三次。三次均错，则提示退出程序。
//
//4.编写一个程序，可以一直接收键盘字符，
//如果是小写字符就输出对应的大写字符，
//如果接收的是大写字符，就输出对应的小写字符，
//如果是数字不输出。；
#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>
#include<stdlib.h>
#include<time.h>

void menu() {
	printf("****************************************************\n");
	printf("*******************猜数字游戏***********************\n");
	printf("********* 选择 1 开始游戏；选择 0 结束游戏 *********\n");
	printf("****************************************************\n");
}
void game() {
	int i=rand();
	i = i % 100;
	int j = 0;
	while (1) {
		printf("*****************************************************\n");
		printf("*******************猜数字游戏************************\n");
		printf("********* 系统将随机产生一个“0-100”的数字 *********\n");
		printf("*****************************************************\n");
		printf("请输入您猜想的数字\n");
		scanf("%d", &j);
		system("cls");
		if (j > i) {
			printf("你猜大了！\n");
			//break;
		}
		if (j < i) {
			printf("你猜小了！\n");
		}
		if (j == i) {
			printf("恭喜你，猜对了！！！\n");
			break;
		}
		
	}
	

}
int main() {
	int input = 0;
	srand((unsigned)time(NULL));
	do {
		menu();
		printf("请输入您选择\n");
		scanf("%d", &input);
	switch (input) {
		case 1:
			system("cls");
			game();
			break;
		case 0:
			printf("游戏结束！！！\n");
			break;
		default:
			printf("选择错误，请重新选择！！！\n");
			break;
		}
	} while (input);

	system("pause");
	return 0;

}
